In [ ]:
import pandas as pd
import openpyxl as xl

In [ ]:
data = pd.read_csv('./dataset.csv', sep=';')
data.head()

Soal No.1 
Peringkat teratas dan terbawah

In [40]:
peringkatBawah = dataList.sort_values(by=['Nilai Akhir']).head()
peringkatBawah

   Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir  Rata Rata  Rank
9  Joko               0         20         30         18.0       16.7    15
8  Iwan              10         30         40         28.0       26.7    14
7  Haha              20         40         50         38.0       36.7    13
6  Gigi              30         50         60         48.0       46.7    12
5  Fafa              40         60         70         58.0       56.7    11

In [39]:
peringkatAtas = dataList.sort_values(by=['Nilai Akhir'], ascending=False).head()
peringkatAtas

      Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir  Rata Rata  Rank
0    Maldy              80         70         90         81.0       80.0     1
11   Alfin              80         70         90         81.0       80.0     1
2     Agus              70         90         80         80.0       80.0     3
13   Rizal              70         90         80         80.0       80.0     3
1   Syarif              90         80         70         79.0       80.0     5

Soal No.2

In [ ]:
dataList = data.iloc[:, :-1]
dataList['Nilai Akhir'] = dataList['Nilai Formatif'] * 0.3 + dataList['Nilai UTS'] * 0.3 + dataList['Nilai UAS'] * 0.4
dataList

menghitung nilai rata-rata

In [ ]:
dataList['Rata Rata'] = ((dataList['Nilai Formatif'] + dataList['Nilai UTS'] + dataList['Nilai UAS']) / 3).round(1)
dataList

Soal No.3

In [ ]:
rataRata = dataList[['Nilai Formatif', 'Nilai UTS', 'Nilai UAS']].mean()
rataRata

Soal No.4
Nilai Akhir tertinggi.

In [ ]:
nilaiAkhirTertinggi = dataList[dataList['Rank'] == 1]
nilaiAkhirTertinggi

Nilai Akhir Terendah

In [33]:
nilaiAkhirTerendah = dataList.sort_values(by=['Nilai Akhir']).head(1)
nilaiAkhirTerendah

   Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir  Rata Rata
9  Joko               0         20         30         18.0       16.7

Soal No.5
Tampilkan nama siswa yang memiliki nilai akhir yang sama

In [34]:
for nilai_akhir, group in dataList.groupby('Nilai Akhir'):
    if len(group) > 1:
        print(f"Nilai Akhir: {nilai_akhir}")
        print(group[['Nama', 'Nilai Akhir']])

Nilai Akhir: 78.0
       Nama  Nilai Akhir
3      Ulfa         78.0
14  Maulana         78.0
Nilai Akhir: 79.0
      Nama  Nilai Akhir
1   Syarif         79.0
12   Rizky         79.0
Nilai Akhir: 80.0
     Nama  Nilai Akhir
2    Agus         80.0
13  Rizal         80.0
Nilai Akhir: 81.0
     Nama  Nilai Akhir
0   Maldy         81.0
11  Alfin         81.0

Soal no.6
Tampilkan nama siswa yang memiliki nilai akhir > 80

In [35]:
nilaiAkhirTinggi = dataList[dataList['Nilai Akhir'] > 80]
nilaiAkhirTinggi

     Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir  Rata Rata
0   Maldy              80         70         90         81.0       80.0
11  Alfin              80         70         90         81.0       80.0

Soal no.7

Berikan peringkat pada masing-masing siswa berdasarkan nilai akhirnya dan tampilkan dalam bentuk dataframe!

In [36]:
dataList['Rank'] = dataList['Nilai Akhir'].rank(ascending=False).astype(int)
dataList

,Nama,Nilai Formatif,Nilai UTS,Nilai UAS,Nilai Akhir,Rata Rata,Rank
0,Maldy,80,70,90,81.0,80.0,1
1,Syarif,90,80,70,79.0,80.0,5
2,Agus,70,90,80,80.0,80.0,3
3,Ulfa,60,80,90,78.0,76.7,7
4,Dea,50,70,80,68.0,66.7,10
5,Fafa,40,60,70,58.0,56.7,11
6,Gigi,30,50,60,48.0,46.7,12
7,Haha,20,40,50,38.0,36.7,13
8,Iwan,10,30,40,28.0,26.7,14
9,Joko,0,20,30,18.0,16.7,15
10,Riyan,98,70,60,74.4,76.0,9
11,Alfin,80,70,90,81.0,80.0,1
12,Rizky,90,80,70,79.0,80.0,5
13,Rizal,70,90,80,80.0,80.0,3
14,Maulana,60,80,90,78.0,76.7,7

Soal No.8

Export hasil data.csv kedalam bentuk excel!

In [38]:
dataList.to_excel('./data_M.xlsx', index=False)